apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mzec_pps.h
#define C2OUT_RPA14R                     14, PIC32MZ_RPA14R
#define C2OUT_RPB5R                      14, PIC32MZ_RPB5R
#define C2OUT_RPB9R                      14, PIC32MZ_RPB9R
#define C2OUT_RPB10R                     14, PIC32MZ_RPB10R
#define C2OUT_RPC1R                      14, PIC32MZ_RPC1R
#define C2OUT_RPC14R                     14, PIC32MZ_RPC14R
#define C2OUT_RPD2R                      14, PIC32MZ_RPD2R
#define C2OUT_RPD6R                      14, PIC32MZ_RPD6R
#define C2OUT_RPD10R                     14, PIC32MZ_RPD10R
#define C2OUT_RPD14R                     14, PIC32MZ_RPD14R
#define C2OUT_RPF1R                      14, PIC32MZ_RPF1R
#define C2OUT_RPF4R                      14, PIC32MZ_RPF4R
#define C2OUT_RPG1R                      14, PIC32MZ_RPG1R
#define C2OUT_RPG8R                      14, PIC32MZ_RPG8R

#define C2TX_RPB2R                       15, PIC32MZ_RPB2R
#define C2TX_RPB6R                       15, PIC32MZ_RPB6R
#define C2TX_RPB14R                      15, PIC32MZ_RPB14R
#define C2TX_RPC2R                       15, PIC32MZ_RPC2R
#define C2TX_RPD0R                       15, PIC32MZ_RPD0R
#define C2TX_RPD1R                       15, PIC32MZ_RPD1R
#define C2TX_RPD5R                       15, PIC32MZ_RPD5R
#define C2TX_RPE8R                       15, PIC32MZ_RPE8R
#define C2TX_RPF2R                       15, PIC32MZ_RPF2R
#define C2TX_RPF3R                       15, PIC32MZ_RPF3R
#define C2TX_RPF13R                      15, PIC32MZ_RPF13R
#define C2TX_RPG9R                       15, PIC32MZ_RPG9R

#define OC1_RPB2R                        12, PIC32MZ_RPB2R
#define OC1_RPB6R                        12, PIC32MZ_RPB6R
#define OC1_RPB14R                       12, PIC32MZ_RPB14R
#define OC1_RPC2R                        12, PIC32MZ_RPC2R
#define OC1_RPD0R                        12, PIC32MZ_RPD0R
#define OC1_RPD1R                        12, PIC32MZ_RPD1R
#define OC1_RPD5R                        12, PIC32MZ_RPD5R
#define OC1_RPE8R                        12, PIC32MZ_RPE8R
#define OC1_RPF2R                        12, PIC32MZ_RPF2R
#define OC1_RPF3R                        12, PIC32MZ_RPF3R
#define OC1_RPF13R                       12, PIC32MZ_RPF13R
#define OC1_RPG9R                        12, PIC32MZ_RPG9R

#define OC2_RPB2R                        11, PIC32MZ_RPB2R
#define OC2_RPB6R                        11, PIC32MZ_RPB6R
#define OC2_RPB14R                       11, PIC32MZ_RPB14R
#define OC2_RPC2R                        11, PIC32MZ_RPC2R
#define OC2_RPD0R                        11, PIC32MZ_RPD0R
#define OC2_RPD1R                        11, PIC32MZ_RPD1R
#define OC2_RPD5R                        11, PIC32MZ_RPD5R
#define OC2_RPE8R                        11, PIC32MZ_RPE8R
#define OC2_RPF2R                        11, PIC32MZ_RPF2R
#define OC2_RPF3R                        11, PIC32MZ_RPF3R
#define OC2_RPF13R                       11, PIC32MZ_RPF13R
#define OC2_RPG9R                        11, PIC32MZ_RPG9R

#define OC3_RPA14R                       11, PIC32MZ_RPA14R
#define OC3_RPB5R                        11, PIC32MZ_RPB5R
#define OC3_RPB9R                        11, PIC32MZ_RPB9R
#define OC3_RPB10R                       11, PIC32MZ_RPB10R
#define OC3_RPC1R                        11, PIC32MZ_RPC1R
#define OC3_RPC14R                       11, PIC32MZ_RPC14R
#define OC3_RPD2R                        11, PIC32MZ_RPD2R
#define OC3_RPD6R                        11, PIC32MZ_RPD6R
#define OC3_RPD10R                       11, PIC32MZ_RPD10R
#define OC3_RPD14R                       11, PIC32MZ_RPD14R
#define OC3_RPF1R                        11, PIC32MZ_RPF1R
#define OC3_RPF4R                        11, PIC32MZ_RPF4R
#define OC3_RPG1R                        11, PIC32MZ_RPG1R
#define OC3_RPG8R                        11, PIC32MZ_RPG8R

#define OC4_RPA15R                       11, PIC32MZ_RPA15R
#define OC4_RPB1R                        11, PIC32MZ_RPB1R
#define OC4_RPB3R                        11, PIC32MZ_RPB3R
#define OC4_RPC4R                        11, PIC32MZ_RPC4R
#define OC4_RPC13R                       11, PIC32MZ_RPC13R
#define OC4_RPD3R                        11, PIC32MZ_RPD3R
#define OC4_RPD7R                        11, PIC32MZ_RPD7R
#define OC4_RPD11R                       11, PIC32MZ_RPD11R
#define OC4_RPD15R                       11, PIC32MZ_RPD15R
#define OC4_RPE5R                        11, PIC32MZ_RPE5R
#define OC4_RPF0R                        11, PIC32MZ_RPF0R
#define OC4_RPF5R                        11, PIC32MZ_RPF5R
#define OC4_RPG0R                        11, PIC32MZ_RPG0R
#define OC4_RPG7R                        11, PIC32MZ_RPG7R

#define OC5_RPB0R                        11, PIC32MZ_RPB0R
#define OC5_RPB7R                        11, PIC32MZ_RPB7R
#define OC5_RPB8R                        11, PIC32MZ_RPB8R
#define OC5_RPB15R                       11, PIC32MZ_RPB15R
#define OC5_RPC3R                        11, PIC32MZ_RPC3R
#define OC5_RPD4R                        11, PIC32MZ_RPD4R
#define OC5_RPD9R                        11, PIC32MZ_RPD9R
#define OC5_RPD12R                       11, PIC32MZ_RPD12R
#define OC5_RPE3R                        11, PIC32MZ_RPE3R
#define OC5_RPE9R                        11, PIC32MZ_RPE9R
#define OC5_RPF8R                        11, PIC32MZ_RPF8R
#define OC5_RPF12R                       11, PIC32MZ_RPF12R
#define OC5_RPG6R                        11, PIC32MZ_RPG6R

#define OC6_RPA14R                       12, PIC32MZ_RPA14R
#define OC6_RPB5R                        12, PIC32MZ_RPB5R
#define OC6_RPB9R                        12, PIC32MZ_RPB9R
#define OC6_RPB10R                       12, PIC32MZ_RPB10R
#define OC6_RPC1R                        12, PIC32MZ_RPC1R
#define OC6_RPC14R                       12, PIC32MZ_RPC14R
#define OC6_RPD2R                        12, PIC32MZ_RPD2R
#define OC6_RPD6R                        12, PIC32MZ_RPD6R
#define OC6_RPD10R                       12, PIC32MZ_RPD10R
#define OC6_RPD14R                       12, PIC32MZ_RPD14R
#define OC6_RPF1R                        12, PIC32MZ_RPF1R
#define OC6_RPF4R                        12, PIC32MZ_RPF4R
#define OC6_RPG1R                        12, PIC32MZ_RPG1R
#define OC6_RPG8R                        12, PIC32MZ_RPG8R

#define OC7_RPA15R                       12, PIC32MZ_RPA15R
#define OC7_RPB1R                        12, PIC32MZ_RPB1R
#define OC7_RPB3R                        12, PIC32MZ_RPB3R
#define OC7_RPC4R                        12, PIC32MZ_RPC4R
#define OC7_RPC13R                       12, PIC32MZ_RPC13R
#define OC7_RPD3R                        12, PIC32MZ_RPD3R
#define OC7_RPD7R                        12, PIC32MZ_RPD7R
#define OC7_RPD11R                       12, PIC32MZ_RPD11R
#define OC7_RPD15R                       12, PIC32MZ_RPD15R
#define OC7_RPE5R                        12, PIC32MZ_RPE5R
#define OC7_RPF0R                        12, PIC32MZ_RPF0R
#define OC7_RPF5R                        12, PIC32MZ_RPF5R
#define OC7_RPG0R                        12, PIC32MZ_RPG0R
#define OC7_RPG7R                        12, PIC32MZ_RPG7R

#define OC8_RPB0R                        12, PIC32MZ_RPB0R
#define OC8_RPB7R                        12, PIC32MZ_RPB7R
#define OC8_RPB8R                        12, PIC32MZ_RPB8R
#define OC8_RPB15R                       12, PIC32MZ_RPB15R
#define OC8_RPC3R                        12, PIC32MZ_RPC3R
#define OC8_RPD4R                        12, PIC32MZ_RPD4R
#define OC8_RPD9R                        12, PIC32MZ_RPD9R
#define OC8_RPD12R                       12, PIC32MZ_RPD12R
#define OC8_RPE3R                        12, PIC32MZ_RPE3R
#define OC8_RPE9R                        12, PIC32MZ_RPE9R
#define OC8_RPF8R                        12, PIC32MZ_RPF8R
#define OC8_RPF12R                       12, PIC32MZ_RPF12R
#define OC8_RPG6R                        12, PIC32MZ_RPG6R

#define OC9_RPB2R                        13, PIC32MZ_RPB2R
#define OC9_RPB6R                        13, PIC32MZ_RPB6R
#define OC9_RPB14R                       13, PIC32MZ_RPB14R
#define OC9_RPC2R                        13, PIC32MZ_RPC2R
#define OC9_RPD0R                        13, PIC32MZ_RPD0R
#define OC9_RPD1R                        13, PIC32MZ_RPD1R
#define OC9_RPD5R                        13, PIC32MZ_RPD5R
#define OC9_RPE8R                        13, PIC32MZ_RPE8R
#define OC9_RPF2R                        13, PIC32MZ_RPF2R
#define OC9_RPF3R                        13, PIC32MZ_RPF3R
#define OC9_RPF13R                       13, PIC32MZ_RPF13R
#define OC9_RPG9R                        13, PIC32MZ_RPG9R

#define REFCLKO1_RPA15R                  15, PIC32MZ_RPA15R
#define REFCLKO1_RPB1R                   15, PIC32MZ_RPB1R
#define REFCLKO1_RPB3R                   15, PIC32MZ_RPB3R
#define REFCLKO1_RPC4R                   15, PIC32MZ_RPC4R
#define REFCLKO1_RPC13R                  15, PIC32MZ_RPC13R
#define REFCLKO1_RPD3R                   15, PIC32MZ_RPD3R
#define REFCLKO1_RPD7R                   15, PIC32MZ_RPD7R
#define REFCLKO1_RPD11R                  15, PIC32MZ_RPD11R
#define REFCLKO1_RPD15R                  15, PIC32MZ_RPD15R
#define REFCLKO1_RPE5R                   15, PIC32MZ_RPE5R
#define REFCLKO1_RPF0R                   15, PIC32MZ_RPF0R
#define REFCLKO1_RPF5R                   15, PIC32MZ_RPF5R
#define REFCLKO1_RPG0R                   15, PIC32MZ_RPG0R
#define REFCLKO1_RPG7R                   15, PIC32MZ_RPG7R

